---
type: ConnectionValidationInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# ConnectionValidationInfo

`Autodesk.Revit.DB.ConnectionValidationInfo` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ConnectionValidationInfo | 2016 | `public ConnectionValidationInfo ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetWarning | 2016 | `public ConnectionValidationWarning GetWarning ( int index )` |
| Method | IsValidWarningIndex | 2016 | `public bool IsValidWarningIndex ( int index )` |
| Method | ManyWarnings | 2016 | `public int ManyWarnings ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |